app/Controllers/Guest/Home.php

SELECT *
FROM `banner`
SELECT `barang`.*, `gambar`.`nama` as `gambar`, SUM(detail_pesanan.jumlah) as pembelian
FROM `barang`
JOIN `gambar` ON `barang`.`id` = `gambar`.`barang_id`
JOIN `detail_pesanan` ON `barang`.`id` = `detail_pesanan`.`barang_id`
GROUP BY `barang`.`id`
ORDER BY `pembelian` ASC
 LIMIT 8
SELECT `barang`.*, `gambar`.`nama` as `gambar`
FROM `barang`
JOIN `gambar` ON `barang`.`id` = `gambar`.`barang_id`
GROUP BY `barang`.`id`
ORDER BY `barang`.`created_at` ASC
 LIMIT 10
---
    public function beranda()
    {
        $getAllBanner = $this->db->table('banner')->get();
        $getBestSeller = $this->db->table('barang')
        ->select('barang.*, gambar_produk.nama as gambar, SUM(detail_pesanan.jumlah) as pembelian')
        ->join('gambar_produk', 'barang.id = gambar_produk.barang_id')
        ->join('detail_pesanan', 'barang.id = detail_pesanan.barang_id')
        ->groupBy('barang.id')
        ->orderBy('pembelian ASC')
        ->limit(8)
        ->get();

        $getNewest = $this->db->table('barang')
        ->select('barang.*, gambar_produk.nama as gambar')
        ->join('gambar_produk', 'barang.id = gambar_produk.barang_id')
        ->groupBy('barang.id')
        ->orderBy('barang.created_at ASC')
        ->limit(10)
        ->get();