app/Controllers/Guest/Katalog.php

    public function index()
    {
        $getAllBarang = $this->db->table('barang')
            ->select('barang.*, gambar_produk.nama as gambar')
            ->join('gambar_produk', 'barang.id = gambar_produk.barang_id', 'left')
            ->groupBy('barang.id')
            ->get();

        $getKategori = $this->db->table('kategori')->get();
---
SELECT `barang`.*, `gambar_produk`.`nama` as `gambar`
FROM `barang`
LEFT JOIN `gambar_produk` ON `barang`.`id` = `gambar_produk`.`barang_id`
GROUP BY `barang`.`id`
SELECT *
FROM `kategori`

    public function detail($slug)
    {
        $getDetailItem = $this->db->table('barang')
            ->where('barang.slug', $slug)
            ->get();

        $getImage = $this->db->table('gambar')
            ->select('gambar.nama, gambar.id')
            ->join('barang', 'gambar.barang_id = barang.id', 'left')
            ->where('barang.slug', $slug) //ku edit barang.slug
            ->get();

        $getImageProduk = $this->db->table('gambar_produk')
            ->select('gambar_produk.nama, gambar_produk.id')
            ->join('barang', 'gambar_produk.barang_id = barang.id', 'left')
            ->where('barang.slug', $slug) //ku edit barang.slug
            ->get();

        $getOtherItem = $this->db->table('barang')->select('barang.*, gambar_produk.nama as gambar')
            ->join('gambar_produk', 'barang.id = gambar_produk.barang_id', 'left')
            ->groupBy('barang.id')
            ->limit(5)
            ->get();
---
SELECT *
FROM `barang`
WHERE `barang`.`slug` = 'handbag-luxury'
SELECT `gambar`.`nama`, `gambar`.`id`
FROM `gambar`
LEFT JOIN `barang` ON `gambar`.`barang_id` = `barang`.`id`
WHERE `barang`.`slug` = 'handbag-luxury'
SELECT `gambar_produk`.`nama`, `gambar_produk`.`id`
FROM `gambar_produk`
LEFT JOIN `barang` ON `gambar_produk`.`barang_id` = `barang`.`id`
WHERE `barang`.`slug` = 'handbag-luxury'
SELECT `barang`.*, `gambar_produk`.`nama` as `gambar`
FROM `barang`
LEFT JOIN `gambar_produk` ON `barang`.`id` = `gambar_produk`.`barang_id`
GROUP BY `barang`.`id`
 LIMIT 5